src/cf/DataProcessors/уатПакетныйВводАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>уатПакетныйВводАгрегатов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/cf/Catalogs/уатМоделиАгрегатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМоделиАгрегатов</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаШирина</Name>
					<Comment>Ширина шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныШирина</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаВысота</Name>
					<Comment>Высота шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныВысота</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаДиаметр</Name>
					<Comment>Диаметр шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныРадиус</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаИндексНагрузки</Name>
					<Comment>Индекс нагрузки шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныПрофиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаИндексСкорости</Name>
					<Comment>Индекс скорости шины</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатШиныИндексыСкорости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаСезонность</Name>
					<Comment>Сезонность шины</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.уатСезонностьШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаТипКонструкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыКонструкцииШин</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШинаДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаПробега</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НормаЗатрат</Name>
					<Comment>Норма затрат, % от стоимости на количество единиц выработки.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Емкость</Name>
					<Comment>Емкость</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатЕмкостьАккумуляторов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбы</Name>
					<Comment>Срок службы агрегата, месяцев</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантНачисленияИзноса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатВариантыНачисленияИзносаАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработкиНачисленияИзноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИзмерениеИзносаВЧасах</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатСерииНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатСерииНоменклатуры</Name>
			<Comment>Агрегаты (уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипАгрегата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатТипыАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Comment>Модель агрегата</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиАгрегатов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервоначальнаяСтоимость</Name>
					<Comment>Первоначальная стоимость агрегата</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Валюта первоначальной стоимости</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоЭксплуатации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоденДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрВыработки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатПараметрыВыработки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПроизводстваШины</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокСлужбыШины</Name>
					<Comment>Срок службы, мес.</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/DataProcessors/уатПакетныйВводАгрегатов/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// начало блока стандартных операций
	ДопПараметрыОткрытие = Новый Структура("ИмяФормы", ИмяФормы);
	уатЗащищенныеФункцииСервер.уатОбработкаФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ТипАгрегата") Тогда
		ТипАгрегата = Параметры.Отбор.ТипАгрегата;
		Параметры.Отбор.Удалить("ТипАгрегата");
	КонецЕсли;
	
	Если Параметры.Свойство("ТипАгрегата") Тогда
		ТипАгрегата = Параметры.ТипАгрегата;
	КонецЕсли;
	Если Параметры.Свойство("Номенклатура") Тогда
		Номенклатура = Параметры.Номенклатура;
	КонецЕсли;
	Если Параметры.Свойство("Количество") Тогда
		СерияКоличество = Параметры.Количество;
	КонецЕсли;
	Если Параметры.Свойство("Цена") Тогда
		Цена = Параметры.Цена;
	КонецЕсли;
	Если Параметры.Свойство("Валюта") Тогда
		Валюта = Параметры.Валюта;
	КонецЕсли;
	Если Параметры.Свойство("НеСоздаватьАгрегаты") Тогда
		НеСоздаватьАгрегаты = Параметры.НеСоздаватьАгрегаты;
	КонецЕсли;
		
	Если Не ЗначениеЗаполнено(Валюта) Тогда
		Валюта = Константы.ВалютаРегламентированногоУчета.Получить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// начало блока стандартных операций
	уатЗащищенныеФункцииКлиент.уатОбработкаФормаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	// конец блока стандартных операций
	
	Если Не ЗначениеЗаполнено(СерияКоличество) Тогда
		СерияКоличество = 2;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТипАгрегата) Тогда
		Элементы.ТипАгрегата.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	ПриИзмененииТипаАгрегата();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипАгрегатаПриИзменении(Элемент)
	
	УстановитьВидимостьИДоступностьЭлементовФормы();
	ПриИзмененииТипаАгрегата();
	
КонецПроцедуры

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Модель) Тогда
		ТипАгрегата       = ПолучитьТипАгрегатаПоМодели(Модель);
		ПараметрВыработки = ПолучитьПараметрВыработкиПоМодели(Модель);
		Если ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
			СрокСлужбыШины = уатОбщегоНазначенияТиповые.ПолучитьЗначениеРеквизита(Модель, "СрокСлужбы");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МодельНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураПараметров = Новый Структура;
	Если ЗначениеЗаполнено(ТипАгрегата) тогда
		СтруктураПараметров.Вставить("ТипАгрегата", ТипАгрегата);
	КонецЕсли;
	
	ФормаВыбора = ПолучитьФорму("Справочник.уатМоделиАгрегатов.ФормаВыбора", СтруктураПараметров, Элемент);
	ФормаВыбора.Открыть();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура кнВыполнить(Команда)
	
	ТекстСообщения = "";
	Если Не ЗначениеЗаполнено(ТипАгрегата) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("en='not specified car part type;';ru='не указан тип агрегата;'") + Символы.ПС;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Модель) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("en='not specified model of car part;';ru='не указана модель агрегата;'") + Символы.ПС;
	КонецЕсли;
	Если СерияКоличество = 0 Или Не ЗначениеЗаполнено(СерияНачальныйНомер) Тогда
		ТекстСообщения = ТекстСообщения + НСтр("en='serial number data is not specified;';ru='не указаны данные по серийным номерам;'") + Символы.ПС;
	КонецЕсли;
	Если ЗначениеЗаполнено(ТекстСообщения) Тогда
		ТекстНСТР = НСтр("en='You can not perform batch generation for the following reasons:';ru='Невозможно выполнить пакетное формирование по следующим причинам:'") + " " + Символы.ПС + ТекстСообщения;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстНСТР);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьСписокСН();
	
	// проверка на дубли сгенерированных СН
	ТекстСообщения = "";
	ДубльСН = Неопределено;
	Если ЕстьДублиСерийныхНомеров(ДубльСН) Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС + СтрШаблон(
			НСтр("en='Several units with the same serial number will be created (%1)';ru='Будет создано несколько агрегатов с одинаковым серийным номером (%1)'"), ДубльСН);
	КонецЕсли;
	
	// проверка на наличие в базе агрегата с таким же СН, как один из сгенерированных
	СписокАгрегатов = ПолучитьСписокАгрегатовПоСерийнымНомерам();
	Если СписокАгрегатов.Количество() Тогда
		ТекстСообщения = ТекстСообщения + Символы.ПС
			+ НСтр("en='For generated serial numbers in system are already have car parts';ru='Для сформированных серийных номеров в системе уже имеются агрегаты'");
		Для Каждого ТекЭлем ИЗ СписокАгрегатов Цикл
			ТекстСообщения = ТекстСообщения + Символы.ПС + " " + ТекЭлем.Наименование + " (" + НСтр("en='serial number';ru='с/н'") + ": " + ТекЭлем.СерийныйНомер + ")";
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ПустаяСтрока(ТекстСообщения) Тогда
		ТекстСообщения = Сред(ТекстСообщения, 2) + Символы.ПС + НСтр("en='Continue?';ru='Продолжить?'");
		ПоказатьВопрос(Новый ОписаниеОповещения("кнВыполнитьЗавершение", ЭтотОбъект), ТекстСообщения,
			РежимДиалогаВопрос.ДаНет, 30, КодВозвратаДиалога.Нет, НСтр("en='Car parts record';ru='Запись агрегатов'"));
		Возврат;
	КонецЕсли;
	
	кнВыполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьШаблон(Команда)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ОбъектНастройки", "Справочник_уатСерииНоменклатуры");
	ПараметрыФормы.Вставить("ТипАгрегата",     ТипАгрегата);
	
	ОткрытьФорму("ОбщаяФорма.уатНастройкаШаблона", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьТипАгрегатаПоМодели(Модель)
	
	Возврат Модель.ТипАгрегата;
	
КонецФункции // ПолучитьТипАгрегатаПоМодели()

&НаСервереБезКонтекста
Функция ПолучитьПараметрВыработкиПоМодели(Модель)
	
	Возврат Модель.ПараметрВыработки;
	
КонецФункции // ПолучитьТипАгрегатаПоМодели()

&НаКлиенте
Процедура ПриИзмененииТипаАгрегата()
	
	Если ЗначениеЗаполнено(Модель) И ПолучитьТипАгрегатаПоМодели(Модель) <> ТипАгрегата Тогда
		Модель = ПредопределенноеЗначение("Справочник.уатМоделиАгрегатов.ПустаяСсылка");
	КонецЕсли;
	
	Если ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
		ГоденДо            = 0;
		НачалоЭксплуатации = 0;
	Иначе
		ДатаПроизводстваШины = 0;
		СрокСлужбыШины       = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокСН()
	
	ОбрОб = РеквизитФормыВЗначение("Объект");
	СписокСН = ОбрОб.СоздатьСписокСерийныхНомеров(СерияНачальныйНомер, СерияКоличество);
	
КонецПроцедуры

&НаСервере
Функция ЕстьДублиСерийныхНомеров(ДубльСН)
	
	Для Сч = 0 По СписокСН.Количество()-1 Цикл
		Для СчВлож = Сч+1 По СписокСН.Количество()-1 Цикл
			Если СписокСН[Сч].Значение = СписокСН[СчВлож].Значение Тогда
				ДубльСН = СписокСН[Сч].Значение;
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

&НаСервере
Функция ПолучитьСписокАгрегатовПоСерийнымНомерам()
	
	МассивРезультат = Новый Массив;
	ТЗ = уатОбщегоназначения.ПолучитьСписокАгрегатовПоСерийнымНомерам(СписокСН);
	Для Каждого ТекЭлемент Из ТЗ Цикл 
		СтрокаРезультат = Новый Структура;
		СтрокаРезультат.Вставить("Наименование",  ТекЭлемент.Значение.Наименование);
		СтрокаРезультат.Вставить("СерийныйНомер", ТекЭлемент.Значение.СерийныйНомер);
		МассивРезультат.Добавить(СтрокаРезультат);
	КонецЦикла;
	
	Возврат МассивРезультат;
	
КонецФункции

&НаСервере
Функция СоздатьАгрегаты()
	
	СписокСформированныхАгрегатов = Новый СписокЗначений;
	
	Для Каждого ТекЭлементСписка Из СписокСН Цикл
		СН = ТекЭлементСписка.Значение; 
		
		Если НЕ НеСоздаватьАгрегаты Тогда
			НовыйАгрегат = Справочники.уатСерииНоменклатуры.СоздатьЭлемент();
		КонецЕсли;
		
		АгрегатСтруктура = Новый Структура;
		АгрегатСтруктура.Вставить("ТипАгрегата", ТипАгрегата);
		АгрегатСтруктура.Вставить("Модель", Модель);
		АгрегатСтруктура.Вставить("Номенклатура", Номенклатура);
		АгрегатСтруктура.Вставить("СерийныйНомер", СН);
		АгрегатСтруктура.Вставить("Родитель", ГруппаАгрегатов);
		АгрегатСтруктура.Вставить("ПараметрВыработки", ПараметрВыработки);
		АгрегатСтруктура.Вставить("Валюта", Валюта);
		АгрегатСтруктура.Вставить("ПервоначальнаяСтоимость", Цена);
		АгрегатСтруктура.Вставить("НачалоЭксплуатации", НачалоЭксплуатации);
		АгрегатСтруктура.Вставить("ГоденДо", ГоденДо);
		АгрегатСтруктура.Вставить("ДатаПроизводстваШины", ДатаПроизводстваШины);
		АгрегатСтруктура.Вставить("СрокСлужбыШины", СрокСлужбыШины);
		
		Если НеСоздаватьАгрегаты Тогда
			СписокСформированныхАгрегатов.Добавить(АгрегатСтруктура);
		Иначе
			ЗаполнитьЗначенияСвойств(НовыйАгрегат, АгрегатСтруктура);
			Попытка 
				НовыйАгрегат.Записать();
			Исключение
				ТекстСообщения = НСтр("en='Failed to record car part:';ru='Не удалось записать агрегат:'") + " " + НовыйАгрегат.Наименование;
				уатОбщегоНазначенияСервер.СообщитьОбОшибке(Объект, ТекстСообщения,,,,);
				Продолжить;
			КонецПопытки;
			СписокСформированныхАгрегатов.Добавить(НовыйАгрегат.Ссылка);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокСформированныхАгрегатов;
	
КонецФункции

&НаКлиенте
Процедура УстановитьВидимостьИДоступностьЭлементовФормы()
	
	Если ТипАгрегата = ПредопределенноеЗначение("Справочник.уатТипыАгрегатов.Шина") Тогда
		Элементы.ГруппаЭксплуатацияШин.Видимость = Истина;
		Элементы.ГруппаЭксплуатация.Видимость = Ложь;
	Иначе
		Элементы.ГруппаЭксплуатацияШин.Видимость = Ложь;
		Элементы.ГруппаЭксплуатация.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура кнВыполнитьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	кнВыполнитьФрагмент();
	
КонецПроцедуры

&НаКлиенте
Процедура кнВыполнитьФрагмент()
	
	ЭтотОбъект.ЗакрыватьПриВыборе = Истина;
	
	СписокСформированныхАгрегатов = СоздатьАгрегаты();
	ОповеститьОВыборе(СписокСформированныхАгрегатов);
	
КонецПроцедуры

#КонецОбласти
